In [2]:
import mysql.connector
import pandas as pd

CREATE CONNECTION

In [5]:
mydb = mysql.connector.connect (
host = 'localhost',
user = 'root',
passwd = 'Pamulang2!',
database = 'world'
)

ACCESS TO DATABASE (1ST METHOD)

In [6]:
#Create Access to Database
mycursor = mydb.cursor()

In [7]:
query = 'select * from city'

In [8]:
mycursor.execute(query)

In [9]:
#Save Result
result = mycursor.fetchall()

In [10]:
df = pd.DataFrame(result, columns = mycursor.column_names)

In [11]:
df.head()

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200

ACCESS TO DATABASE (2nd METHOD)

In [12]:
mycursor = mydb.cursor()

In [13]:
#Create Function
def sql_df(yourQuery) :
    mycursor.execute(yourQuery)
    myresult = mycursor.fetchall()
    df = pd.DataFrame(myresult, columns = mycursor.column_names)
    return df

In [14]:
sql_df(
'''
select * from city limit 5
''')

   ID            Name CountryCode       District  Population
0   1           Kabul         AFG          Kabol     1780000
1   2        Qandahar         AFG       Qandahar      237500
2   3           Herat         AFG          Herat      186800
3   4  Mazar-e-Sharif         AFG          Balkh      127800
4   5       Amsterdam         NLD  Noord-Holland      731200